{
  "Passed Legislation": [
    {
      "link": "http://ilga.gov/legislation/billstatus.asp?DocNum=3394&GAID=15&GA=101&DocTypeID=HB&LegID=119985&SessionID=108",
      "id": "HB3394",
      "date": "August 27, 2019",
      "title": "Diverse Corporate Boards",
      "description": "This corporate board diversity bill mandates that publicly traded companies in Illinois report on their websites the demographics of their board and executive ranks as well as plans for promoting diversity in the workplace. The bill also requires an annual report card on Illinois companies’ diversity to be published by the University of Illinois.  Investing in companies that support gender and racial equity is not only the right thing to do, but it makes the most financial sense. Companies in the top quartile for racial and ethnic diversity are 35 percent more likely to have financial returns above their respective industry and sector medians."
    },
    {
      "link": "http://ilga.gov/legislation/billstatus.asp?DocNum=3534&GAID=15&GA=101&DocTypeID=HB&LegID=120195&SessionID=108",
      "id": "HB3534",
      "date": "August 21, 2019",
      "title": "SOS Docs – Gender Designations",
      "description": "This bill allows individuals to identify as “non-binary” on their driver’s license as well as other local government forms and documents. When an ID does not match the gender identity or expression of the individual, that person can be potentially exposed to dangerous or uncomfortable situations. It is important to modernize policies and have legislation that values inclusion."
    },
    {
      "link": "http://ilga.gov/legislation/billstatus.asp?DocNum=2090&GAID=15&GA=101&DocTypeID=SB&LegID=120174&SessionID=108",
      "id": "SB2090",
      "date": "August 21, 2019",
      "title": "Voting in Jails",
      "description": "People in jail who are awaiting trial are eligible to vote. This bill will require county jails and election authorities to ensure people who have not been convicted and are awaiting trial can cast their ballot during elections; it also requires IDOC to provide eligible citizens released from their custody a voter registration application and detailed information about their voting rights. This bill works to combat voter suppression, educate our residents, and increase voter turnout."
    },
    {
      "link": "http://ilga.gov/legislation/billstatus.asp?DocNum=75&GAID=15&GA=101&DocTypeID=SB&LegID=115041&SessionID=108",
      "id": "SB75",
      "date": "August 12, 2019",
      "title": "Sexual Harassment Omnibus Package",
      "description": "This bill is the result of incorporating several individual proposals into one comprehensive and cohesive package including the creation of the Workplace Transparency Act,  the Sexual Harassment Victim Representation Act, the Hotel & Casino Employee Safety Act; and amendments to the Illinois Human Rights Act, the Freedom of Information Act, and the Victims’ Economic Security and Safety Act. This bill is about changing behaviors. It’s about creating employer accountability. And it’s about institutionalizing protections in the workplace for all women that will ultimately create safe, healthy and respectful work environments for all."
    },
     {
      "link": "http://www.ilga.gov/legislation/billstatus.asp?DocNum=2265&GAID=15&GA=101&DocTypeID=HB&LegID=118100&SessionID=108",
      "id": "HB2265",
      "date": "August 9, 2019",
      "title": "Civics Education Act",
      "description": "This bill will require every public elementary school to include in its 6th, 7th, or 8th grade curriculum at least one semester of civics education. Having our youth participate in civics education will allow them to have more confidence in their ability to make informed political decisions, increase their knowledge about history, develop their ethical awareness and empathy, and recognize the importance of voting."
    },
    {
      "link": "http://ilga.gov/legislation/billstatus.asp?DocNum=2265&GAID=15&GA=101&DocTypeID=HB&LegID=118100&SessionID=108",
      "id": "HB246",
      "date": "August 9, 2019",
      "title": "LGBT Curriculum",
      "description": "This bill will include the contributions of LGBTQ people in the history curriculum in public schools. Throughout our history, individuals have not been acknowledged or remain hidden due to their gender and sexual identity. Such inclusion will be a way to teach students that no matter their sexual or gender identity, they are valuable members of society."
    },
       {
      "link": "http://ilga.gov/legislation/billstatus.asp?DocNum=834&GAID=15&GA=101&DocTypeID=HB&LegID=115119&SessionID=108",
      "id": "HB834",
      "date": "July 31, 2019",
      "title": "No Salary History Bill",
      "description": "This bill will strengthen the existing Illinois Equal Pay Act by making it illegal for an employer to ask about prior salaries or wages of applicants, which is a common hiring practice that contributes to the gender wage gap by perpetuating income inequalities, particularly against women and people of color."
    },
    {
      "link": "http://ilga.gov/legislation/billstatus.asp?DocNum=1438&GAID=15&GA=101&DocTypeID=HB&LegID=115810&SessionID=108",
      "id": "HB1438",
      "date": "June 25, 2019",
      "title": "Adult Cannabis Legalization",
      "description": "This bill was crafted by four moms in the Illinois General Assembly who, when writing this bill, had three things in mind: public safety, social justice, and revenue for the state. When signed into law, this bill will make it legal to purchase and possess marijuana in the state if you are 21 or over. It marks an historic moment in an expanding national movement by making Illinois the 11th state to legalize cannabis and the first state in which a legislature approved commercial sales."
    },
    {
      "link": "http://ilga.gov/legislation/billstatus.asp?DocNum=25&GAID=15&GA=101&DocTypeID=SB&LegID=114175&SessionID=108",
      "id": "HB25",
      "date": "June 12, 2019",
      "title": "The Reproductive Health Act",
      "description": "This bill establishes the fundamental right to reproductive health and modernizes Illinois’ reproductive rights laws by repealing outdated and unconstitutional prohibitions on reproductive healthcare and enacting a new Illinois Reproductive Health Act that regulates abortion like any other form of health care. Contrary to rumors, the law will primarily codify what is already being followed as law. But it also provides additional certainty that what we understand to be the law remains the law. As states across the country are passing laws in order to challenge Roe v. Wade with the Supreme Court, this law will help ensure that Illinois remains a pro-choice state where reproductive healthcare is safe and accessible."
    },
    {
      "link": "http://ilga.gov/legislation/billstatus.asp?DocNum=3550&GAID=15&GA=101&DocTypeID=HB&LegID=120212&SessionID=108",
      "id": "HB3550",
      "date": "March 29, 2019",
      "title": "Consent Education",
      "description": "This bill will add a comprehensive definition of consent to the sex education curriculum in secondary schools. Schools will have to include several points in their teachings on consent, such as explaining that people cannot consent if they are intoxicated or asleep, and that ‘consent’ to one particular sexual activity does not constitute consent to other types of sexual activities. The bill goes on to specify what should not be mistaken for consent, such as what someone is wearing. Providing consent education to our youth will promote safe and healthy relationships and will aid in the efforts to prevent sexual assault."
    }
  ],
"Ongoing Initiatives": [
    {
      "link": "https://secure.foodandwaterwatch.org/act/tell-mayor-lightfoot-chicago-needs-affordable-water",
      "id": "WaterForAll",
      "title": "Water-For-All Ordinance",
      "description": "You signed petitions and you called your alderman to help pass Chicago’s Water-For-All Ordinance. This ordinance would aid families with annual household incomes less than twice the federal poverty line, or $50,200 for a family of four. As water bills continue to rise, the ordinance would make sure that the poorest Chicagoans are protected from shutoffs. We are pleased to provide you with an update that newly elected Mayor Lori Lightfoot has pledged to halt water shut-offs to Chicago households. A victory indeed, but are work is not done. Chicago water bills are still on the rise; the typical water bill has tripled in the last decade. Now, we have a real opportunity to implement an income-based water affordability program here in Chicago to ensure that water is accessible to every household.  Urge Mayor Lightfoot to support affordable water for all in Chicago!"
    },
    {
      "link": "http://ilga.gov/legislation/billstatus.asp?DocNum=4&GAID=15&GA=101&DocTypeID=HB&LegID=113807&SessionID=108",
      "id": "HB4",
      "title": "Doula Services",
      "description": "This bill provides that doula services shall be covered under the medical assistance program. It is vital that we make programs available to all in order to reduce the maternal mortality rate in Illinois, especially for Black moms."
    },
    {
      "link": "http://ilga.gov/legislation/billstatus.asp?DocNum=9&GAID=15&GA=101&DocTypeID=HB&LegID=113812&SessionID=108",
      "id": "HB9",
      "title": "Paid Maternity Act",
      "description": "This bill would require private employers with 50 or more employees to provide 6 weeks of paid leave for an employee who takes leave. Family caregiving responsibilities, particularly motherhood, can lead to interruptions in career paths for women and can have an impact on long-term earnings. Establishing an appropriate amount of maternity leave reduces the need for a woman to be forced into making a choice between work and children during a pivotal life time event."
    },
    {
      "link": "http://ilga.gov/legislation/billstatus.asp?DocNum=1594&GAID=15&GA=101&DocTypeID=SB&LegID=118624&SessionID=108",
      "id": "SB1594",
      "title": "Repeal Parental Notification of Abortion",
      "description": "This bill repeals the Parental Notice of Abortion Act of 1995. Legislation mandating parental involvement does not achieve the intended benefit of promoting family communication, but it does increase the risk of harm to our youth by delaying access to medical care. It is important to ensure all individuals including our youth to have access to confidential healthcare and to maintain body autonomy."
    },
    {
      "link": "http://www.ilga.gov/legislation/billstatus.asp?DocNum=449&GAID=15&GA=101&DocTypeID=SB&LegID=116386&SessionID=108",
      "id": "SB449",
      "title": "The Ensuring Success in Schools Law",
      "description": "This bill requires that students who are pregnant, parenting, or expecting to parent, as well as students who have survived gender-based violence are appropriately accommodated at school. Too many young people are pushed out or forced into involuntary home school situations because schools do not provide the proper supports to keep the youth in schools. Reproductive justice is more than abortion and birth control – we need to ensure those who choose to parent can succeed."
    }
   ]
}