{
  "Spring 2019": [
    {
      "id": "SB75",
      "date": "August 12, 2019",
      "title": "Sexual Harassment Omnibus Package",
      "description": "This bill is the result of incorporating several individual proposals into one comprehensive and cohesive package including the creation of the Workplace Transparency Act,  the Sexual Harassment Victim Representation Act, the Hotel & Casino Employee Safety Act; and amendments to the Illinois Human Rights Act, the Freedom of Information Act, and the Victims’ Economic Security and Safety Act. This bill is about changing behaviors. It’s about creating employer accountability. And it’s about institutionalizing protections in the workplace for all women that will ultimately create safe, healthy and respectful work environments for all."
    },
     {
      "id": "HB2265",
      "date": "August 9, 2019",
      "title": "Civics Education Act",
      "description": "This bill will require every public elementary school to include in its 6th, 7th, or 8th grade curriculum at least one semester of civics education. Having our youth participate in civics education will allow them to have more confidence in their ability to make informed political decisions, increase their knowledge about history, develop their ethical awareness and empathy, and recognize the importance of voting."
    },
    {
      "id": "HB1438",
      "date": "June 25, 2019",
      "title": "Adult Cannabis Legalization",
      "description": "This bill was crafted by four moms in the Illinois General Assembly who, when writing this bill, had three things in mind: public safety, social justice, and revenue for the state. When signed into law, this bill will make it legal to purchase and possess marijuana in the state if you are 21 or over. It marks an historic moment in an expanding national movement by making Illinois the 11th state to legalize cannabis and the first state in which a legislature approved commercial sales."
    },
    {
      "id": "HB2495",
      "date": "June 12, 2019",
      "title": "The Reproductive Health Act",
      "description": "This bill establishes the fundamental right to reproductive health and modernizes Illinois’ reproductive rights laws by repealing outdated and unconstitutional prohibitions on reproductive healthcare and enacting a new Illinois Reproductive Health Act that regulates abortion like any other form of health care. Contrary to rumors, the law will primarily codify what is already being followed as law. But it also provides additional certainty that what we understand to be the law remains the law. As states across the country are passing laws in order to challenge Roe v. Wade with the Supreme Court, this law will help ensure that Illinois remains a pro-choice state where reproductive healthcare is safe and accessible."
    },
    {
      "id": "HB2495",
      "date": "March 29, 2019",
      "title": "Consent Education",
      "description": "This bill will add a comprehensive definition of consent to the sex education curriculum in secondary schools. Schools will have to include several points in their teachings on consent, such as explaining that people cannot consent if they are intoxicated or asleep, and that ‘consent’ to one particular sexual activity does not constitute consent to other types of sexual activities. The bill goes on to specify what should not be mistaken for consent, such as what someone is wearing. Providing consent education to our youth will promote safe and healthy relationships and will aid in the efforts to prevent sexual assault."
    }
  ]
}