[
  {
    "id": 0,
    "name": "Marissa Miller",
    "filename": "MarissaMiller.jpg",
    "position": "President, Assistant Treasurer",
    "bio": "Former compliance and regulatory consultant, currently working as an office manager at a Chicago/Springfield consulting firm because I wanted to get back into politics.",
    "intro": "The issue I’m most passionate about working on within She Votes Illinois: Voter registration and turnout, particularly among millennials. \\nMy hobbies: traveling, watching hockey, cooking classes, and taking obscure Chicago city tours that are used to develop my own customized tours for visiting friends.\\n Two fun things I’ve done: 1) I like climbing to high points in whatever city I’m in – the ‘roughest’ climb was probably the Duomo because the stairs are small and it’s a tight space, so it’s hard to get a good stride. 2) I went to this amazing bread making class at Cook Au Vin where you just stuff dough with whatever you want and take home a bag of freshly made bread. It was a beautiful day."
  },
  {
    "id": 1,
    "name": "Maureen M. Keane",
    "filename": "MaureenKeane.jpg",
    "position": "Co-founder, Secretary & Treasurer",
    "bio": "Born and raised in Chicago. NIU business grad. Career in investment management turned business development advisor. Humanitarian. Community and political activist. Amateur photographer. Nature lover. Solo adventure traveler.",
    "intro": "The issue I’m most passionate about working on within She Votes Illinois: I am passionate about educating the public in order to activate them and work with legislators to effect positive change on issues important to women.\\n My hobbies: Solo adventure travel – I want to see the world while riding a horse, rafting down river, or hiking up a mountain. \\n Two fun things I’ve done: Dog sledding during a blizzard in Greenland and sand boarding down an active volcano in Nicaragua."
  },
  {
    "id": 2,
    "name": "Robin Dusek",
    "filename": "RobinDusek.jpg",
    "position": "Officer At-large",
    "bio": "Lawyer, activist, doer. In addition to a full-time law practice, I run a non-profit that started/supports a school in Uganda, and have been spending any remaining time devoted to political activism. Oh, and I have dogs and cats, and foster kittens.",
    "intro": "The issue I’m most passionate about working on within She Votes Illinois: I’m passionate about voting. I’ve never missed voting in an election I was eligible to vote in and I want others to feel just as engaged. To do this, I think it’s important for people to hear politicians and candidates talking about issues important to women in the state.\\n My hobbies: Running, photography, hanging with my pets, traveling, and trying to read the entire internet. \\n Two fun things I’ve done: I was able to pet/cuddle some cheetahs in Nairobi (it helps to be nice to everyone…you never know who will say “do you want to meet a cheetah”). I’ve run 4 marathons and one 50 mile event."
  },
  {
    "id": 3,
    "name": "Emmy Carragher",
    "filename": "EmmyCarragher.jpg",
    "position": "Board Member",
    "bio": "With a heart for hospitality, a commitment to community, and a passion for policy, Emmy has worked in both the public and private sectors of communications and strategy development. From Choose Chicago’s marketing team to hospitality PR firm Wagstaff Worldwide and strategy and innovation firm 18 Coffees, Emmy has worked to open hotels, promote cultural institutes, tell big stories, and direct strategy. She is involved with the leadership committee of the Associate Board of Greater Chicago Food Depository, OFA’s newest Chicago Chapter, the Chicago Council on Global Affairs’ Young Professionals Network, and United State of Women’s inaugural Chicago Galvanize Program. She has also worked to further the Chicago agenda of Chi Women Vote and Ladies Get Paid to keep women engaged and active in their community.",
    "intro": "The issue I’m most passionate about working on within She Votes Illinois: Voter registration and economic empowerment of women\\n My hobbies: Traveling, Singing (preferably classic jazz and blues), Playing ultimate frisbee, and hosting dinners for friends, family & community members \\n Two fun things I’ve done: For a city dweller, loves to hike — has hiked The Great Wall of China, and Table Mountain in Cape Town, South Africa"
  },
  {
    "id": 4,
    "name": "Sophia Madana",
    "filename": "LorenaMesa.jpg",
    "position": "Board Member",
    "bio": "Digital Marketer with a background in Journalism, and a passion for politics and activism. Born and raised in Illinois. I have a strong belief in equity and equality, and joined She Votes Illinois to amplify women’s voices. ",
    "intro": "The issue I’m most passionate about working on within She Votes Illinois: Voter outreach education. The great American Experiment doesn’t work if we don’t all participate. \\n My hobbies: Trying new things; new food, new watering holes, new music, new authors, and anything in between.\\n Two fun things I’ve done: Won a cruise to the Bahamas, performed live-band karaoke!"
  },
  {
    "id": 5,
    "name": "Lorena Mesa",
    "filename": "LorenaMesa.jpg",
    "position": "Board Member, Communications Director",
    "bio": "Political scientist turned coder, Lorena Mesa is a data engineer on GitHub’s software intelligence systems team, Director on the Python Software Foundation, PyLadies Chicago co-organizer, and our newest She Votes Illinois Director! Lorena’s background in research and applied mathematics drove Lorena to pursue a career in engineering and data science. One part activist, one part Star Wars fanatic, and another part Trekkie, Lorena abides by the motto to \\“live long and prosper\\”.",
    "intro": "The issue I’m most passionate about working on within She Votes Illinois is: empowering women in Illinois! \\n My hobbies: running marathons, teaching Python to women and marginalized people in tech, and cosplaying all the Star Trek!\\n My favorite food: Black bean vegan tamales!"
  },
  {
    "id": 6,
    "name": "Aoife Reynolds",
    "filename": "AoifeReynolds.jpg",
    "position": "Board Member",
    "bio": "I am currently a junior at the Latin School of Chicago. I’m incredibly passionate about politics and have always been dedicated to bringing justice and equity to my community and communities in need.",
    "intro": "The issue I’m most passionate about working on within She Votes Illinois: Engaging young women in politics and empowering them with a platform for their voices to be valued.\\n My hobbies: I love listening to music, going to concerts and djing\\n My favorite food: Sushi"
  },
  {
    "id": 7,
    "name": "Stephanie Sims",
    "filename": "StephanieSims.jpg",
    "position": "Board Member",
    "bio": "Stephanie is a sales and marketing professional with a passion for politics, especially female candidates and woman run campaigns. Originally from Atlanta, she now calls Chicago home and got involved in Illinois politics as volunteer lead organizing weekly phone banks during the gubernatorial primary for one of the candidates. ",
    "intro": "The issue I’m most passionate about working on within She Votes Illinois: getting women believing in our democracy, excited about voting, and engaged in politics\\n My hobbies: traveling and working out \\n My favorite food: ice cream"
  },
  {
    "id": 8,
    "name": "Quandra Speights",
    "filename": "QuandraSpeights.jpg",
    "position": "Board Member",
    "bio": "Associate Attorney at Tricelaw firm, Clark Atlanta University honors graduate holding a BA in Business Management, an MA in HRIR from the University of MN, an MBA from a Nova Southeastern University, and a JD from Valparaiso University School of Law. I used my upbringing from one of Chicago’s worst Westside neighborhoods as a catalyst to become an accomplished professional and have always felt an obligation to serve as a role model to support the youth in my community. Currently, I sit on several other boards such as the NAACP, DuSable Community Coalition, No Shots Fired and volunteer with my sorority, Alpha Kappa Alpha, including other community organizations.",
    "intro": "The issue I’m most passionate about working on within She Votes Illinois: My vision for She Votes IL is to support and advocate for more women in political office. \\n My hobbies: Traveling and relaxing at home \\n My favorite food: Vegan cuisine and desserts"
  },
  {
    "id": 9,
    "name": "Annie Williams",
    "filename": "AnnieWilliams.jpg",
    "position": "Board Member",
    "bio": "Annie served as Policy Lead for Women’s Issues with Indivisible Illinois and Outreach Leader for the Illinois chapter of the Women’s March on Washington. Annie organized silent protests inspired by “The Handmaid’s Tale” in support of HB 40. She was part of a coalition of women who worked to ratify the Equal Rights Amendment in Illinois. She has orchestrated voter engagement activities; deputy registrar training, voter education and high school voter registration events.",
    "intro": "The issue I’m most passionate about working on within She Votes Illinois is: Because of the historic November 2018 election, Annie is excited to get more voters to the polls. \\n My hobbies: Annie loves to knit and crochet. When she retired in 2013, one of her goals was to take classes to learn these crafts. She thought she would be making hats and scarves for her nieces and nephews; she ended up making dozens of pussy hats! \\n The best advice I ever received: As a citizen activist, the advice that has guided her is that the goal of any organization that you work with is to build power in order to make change."
  },
  {
    "id": 10,
    "name": "Bushra Amiwala",
    "filename": "BushraAmiwala.jpg",
    "position": "Advisory Council",
    "bio": "Bushra is the youngest Muslim elected official in the United States. She is currently an undergraduate junior at DePaul University and hopes to start a nonprofit organization post graduation focusing education inequality. Bushra is proud to have registered over two thousand people to vote in 2018 election cycle.",
    "intro": "The issue I’m most passionate about working on within She Votes Illinois is: getting more people engaged in the political process.\\n My hobbies: Board games, arcade games and toy crane machines — I am very skilled at all the above \\n Best advice ever given: Everything that is happening to you, is supposed to happen, so just relax. (Spin on everything happens for a reason)."
  },
  {
    "id": 11,
    "name": "Leah Cunningham Pouw",
    "filename": "LeahPouw.jpg",
    "position": "Advisory Council",
    "bio": "Leah Cunningham Pouw works alongside school districts, elected officials and government agencies to increase family and community engagement using systems development, behavioral economics and design thinking. She recently ran Jeff Jenkins’s campaign for 47th Ward alderman.",
    "intro": "The issue I’m most passionate about working on within She Votes Illinois is: supporting more women in their quest to serve the public and increasing overall voter turnout.\\n My hobbies: I am an avid bread baker and delight in creating cocktails for friends and neighbors. I thrive in time spent in nature – camping, hiking, bike riding. I have two kids, a puppy and husband – and we all love to travel!\\n Who has inspired you: Donna Shalala, then chancellor at the University of Wisconsin-Madison, welcomed new students my first week and said, “Study what you love! The rest will follow.” I’ve watched her career evolve and find inspiration in her, Madelyn Albright and other successful women in government who are also moms – how did they get it all done? We can do this!"
  },
  {
    "id": 13,
    "name": "Mary Catherine Hanafee LaPlante",
    "filename": "MaryLaPlante.jpg",
    "position": "Advisory Council",
    "bio": "Mary Catherine is a junior at Prospect High School. She is an avid activist for women’s rights and the environment in the Chicagoland area. She organized the first Chicago Period Rally, works on the core team of the IL Youth Climate Strike, and strives to make her community a healthier and safer place for all people.",
    "intro": "The issue I’m most passionate about working on within She Votes Illinois is: women’s health, and the intersection between climate change and gender equity. \\n My hobbies: I love singing, playing basketball and softball, reading, running, and competing in Science Olympiad.\\n The best advice I was ever given: to be unapologetically confident in all aspects of life."
  },
  {
    "id": 14,
    "name": "Heather McMeekan",
    "filename": "HeatherMcMeekan.jpg",
    "position": "Advisory Council",
    "bio": "I’m a professional webmaster, working for a university. I’m an activist, advocate, and founder of the Democratic Women of McDonough County, and one of the organizers and serve as the social media coordinator for Indivisible of West Central Illinois. I’m also a former paramedic and Illinois State EMS Instructor with my M.S. in Health Education with an emphasis in Community Health. I’m a big believer in education and prevention.",
    "intro": "The issue I’m most passionate about working on within She Votes Illinois is: increasing voter participation at all levels from women living downstate.\\n My hobbies: I have a lot of them! I love leading and participating in Drum Circles, seeing movies with friends, and reading. I also fly sport and show kites, and created a kite festival that is in it’s fourth year in my community. I travel around the region bringing my kites to kids events all over west central IL. I also enjoy kayaking, playing all kinds of tabletop games, and I’m a multimedia artist. \\n The best advice I ever received: was to prioritize spending time with women friends, colleagues, and mentors."
  },
  {
    "id": 15,
    "name": "Clarinda Valentine",
    "filename": "ClarindaValentine.jpg",
    "position": "Advisory Council",
    "bio": "I have long believed that the opportunity to vote is a right, not a privilege available to a few. I have fought for years to ensure that polling locations are accessible to individuals with physically, emotional, social or mental challenges. Not only must individuals be able to vote, but I continue to push that they educate themselves on the issues and the positions a candidate holds, on the positions that are important to them. I encourage individuals to make sure they hold their elected official responsible after the election, meaning they should put contact information in their phone and use it.",
    "intro": "The issue I’m most passionate about working on within She Votes Illinois is: voter education \\n My hobbies: While this may not be a hobby, a passion of mine is ensuring that people with a disability are fully included in every part of society.  As hobbies I do adaptive rocking climbing and now I am learning to scuba dive.  I enjoy sewing. \\n The best advice I ever received: Relax, take a deep breath. Now move forward. Nothing is impossible. If you can conceive it; You believe it; you can achieve it."
  },
  {
    "id": 16,
    "name": "Annie Warshaw",
    "filename": "AnnieWarshaw.jpg",
    "position": "Advisory Council",
    "bio": "Annie Warshaw is the co-founder and CEO of Mission Propelle, a gender equity and yoga after -school program that serves the Chicagoland area. She is also an adjunct professor with the Women and Gender Studies department at Roosevelt University. Annie has worked with a number of women focused organizations throughout the Chicago and is determined to have an impact on voter turnout in the 2020 elections.",
    "intro": "The issue I’m most passionate about working on within She Votes Illinois is: Ensuring that women (specifically in under represented communities) turn out to vote in 2020. \\n My hobbies: I am a mom to two under three years old so a lot of my time is spent taking walks and going to parks. I love working out, being with my family and swimming.\\n The best advice I ever received: Wait to speak, listen first." 
  }
]
